/* package up error # */
"error %1$d" = "erro %1$d";
"error %1$#x" = "erro %1$#x";
/* errno error 0 */
"Unknown error: 0" = "Erro desconhecido: 0";

/* errno error 1 */
"Operation not permitted" = "Operação não permitida";

/* errno error 2 */
"No such file or directory" = "Esse arquivo ou diretório não existe";

/* errno error 3 */
"No such process" = "Esse processo não existe";

/* errno error 4 */
"Interrupted system call" = "Chamada de sistema interrompida";

/* errno error 5 */
"Input/output error" = "Erro de entrada/saída";

/* errno error 6 */
"Device not configured" = "Dispositivo não configurado";

/* errno error 7 */
"Argument list too long" = "Lista de argumentos muito longa";

/* errno error 8 */
"Exec format error" = "Erro de formato de execução";

/* errno error 9 */
"Bad file descriptor" = "Descritor de arquivos inválido";

/* errno error 10 */
"No child processes" = "Não há nenhum processo secundário";

/* errno error 11 */
"Resource deadlock avoided" = "Bloqueio de recurso evitado";

/* errno error 12 */
"Cannot allocate memory" = "Não é possível alocar memória";

/* errno error 13 */
"Permission denied" = "Permissão negada";

/* errno error 14 */
"Bad address" = "Endereço inválido";

/* errno error 15 */
"Block device required" = "Dispositivo de bloqueio requerido";

/* errno error 16 */
"Resource busy" = "Recurso ocupado";

/* errno error 17 */
"File exists" = "O arquivo existe";

/* errno error 18 */
"Cross-device link" = "Link de dispositivo cruzado";

/* errno error 19 */
"Operation not supported by device" = "Operação incompatível com o dispositivo";

/* errno error 20 */
"Not a directory" = "Não é um diretório";

/* errno error 21 */
"Is a directory" = "É um diretório";

/* errno error 22 */
"Invalid argument" = "Argumento inválido";

/* errno error 23 */
"Too many open files in system" = "Excesso de arquivos abertos no sistema";

/* errno error 24 */
"Too many open files" = "Excesso de arquivos abertos";

/* errno error 25 */
"Inappropriate ioctl for device" = "Controle de entrada/saída inadequado para o dispositivo";

/* errno error 26 */
"Text file busy" = "Arquivo de texto ocupado";

/* errno error 27 */
"File too large" = "Arquivo grande demais";

/* errno error 28 */
"No space left on device" = "Não resta espaço no dispositivo";

/* errno error 29 */
"Illegal seek" = "Busca ilegal";

/* errno error 30 */
"Read-only file system" = "Sistema de arq. do tipo somente leitura";

/* errno error 31 */
"Too many links" = "Há muitos links";

/* errno error 32 */
"Broken pipe" = "Canal quebrado";

/* errno error 33 */
"Numerical argument out of domain" = "Argumento numérico fora do domínio";

/* errno error 34 */
"Result too large" = "Resultado grande demais";

/* errno error 35 */
"Resource temporarily unavailable" = "Recurso temporariamente indisponível";

/* errno error 36 */
"Operation now in progress" = "Operação em andamento agora";

/* errno error 37 */
"Operation already in progress" = "Operação já em andamento";

/* errno error 38 */
"Socket operation on non-socket" = "Operação de soquete em um não-soquete";

/* errno error 39 */
"Destination address required" = "Endereço de destino requerido";

/* errno error 40 */
"Message too long" = "Mensagem grande demais";

/* errno error 41 */
"Protocol wrong type for socket" = "Tipo incorreto de protocolo para soquete";

/* errno error 42 */
"Protocol not available" = "Protocolo não disponível";

/* errno error 43 */
"Protocol not supported" = "Protocolo incompatível";

/* errno error 44 */
"Socket type not supported" = "Tipo de soquete incompatível";

/* errno error 45 */
"Operation not supported" = "Operação incompatível";

/* errno error 46 */
"Protocol family not supported" = "Família de protocolos incompatível";

/* errno error 47 */
"Address family not supported by protocol family" = "Família de endereços incompatível com família de protocolos";

/* errno error 48 */
"Address already in use" = "O endereço já está sendo usado";

/* errno error 49 */
"Can't assign requested address" = "Não é possível atribuir o endereço solicitado";

/* errno error 50 */
"Network is down" = "A rede está inativa";

/* errno error 51 */
"Network is unreachable" = "A rede está incomunicável";

/* errno error 52 */
"Network dropped connection on reset" = "A rede interrompeu a conexão no reinício";

/* errno error 53 */
"Software caused connection abort" = "O software provocou o cancelamento da conexão";

/* errno error 54 */
"Connection reset by peer" = "Conexão reiniciada por semelhante";

/* errno error 55 */
"No buffer space available" = "Não há espaço de armaz. intermediário disponível";

/* errno error 56 */
"Socket is already connected" = "O soquete já está conectado";

/* errno error 57 */
"Socket is not connected" = "O soquete não está conectado";

/* errno error 58 */
"Can't send after socket shutdown" = "Não é possível enviar após desligar o soquete";

/* errno error 59 */
"Too many references: can't splice" = "Excesso de referências: não é possível combinar";

/* errno error 60 */
"Operation timed out" = "O tempo limite da operação se esgotou";

/* errno error 61 */
"Connection refused" = "Conexão recusada";

/* errno error 62 */
"Too many levels of symbolic links" = "Há muitos níveis de links simbólicos";

/* errno error 63 */
"File name too long" = "Nome de arquivo muito longo";

/* errno error 64 */
"Host is down" = "O host está inativo";

/* errno error 65 */
"No route to host" = "Não há nenhuma rota para o host";

/* errno error 66 */
"Directory not empty" = "O diretório não está vazio";

/* errno error 67 */
"Too many processes" = "Excesso de processos";

/* errno error 68 */
"Too many users" = "Excesso de usuários";

/* errno error 69 */
"Disc quota exceeded" = "Cota de disco ultrapassada";

/* errno error 70 */
"Stale NFS file handle" = "Controlador de arquivo NFS antigo";

/* errno error 71 */
"Too many levels of remote in path" = "Há muitos níveis de remoto no caminho";

/* errno error 72 */
"RPC struct is bad" = "Est. RPC inválida";

/* errno error 73 */
"RPC version wrong" = "Versão RPC inválida";

/* errno error 74 */
"RPC prog. not avail" = "Prog. RPC não disp";

/* errno error 75 */
"Program version wrong" = "Versão de programa incorreta";

/* errno error 76 */
"Bad procedure for program" = "Procedimento inválido para programa";

/* errno error 77 */
"No locks available" = "Não há nenhum bloqueio disponível";

/* errno error 78 */
"Function not implemented" = "Função não implementada";

/* errno error 79 */
"Inappropriate file type or format" = "Tipo ou formato de arquivo inadequado";

/* errno error 80 */
"Authentication error" = "Erro de autenticação";

/* errno error 81 */
"Need authenticator" = "É necessário um autenticador";

/* errno error 82 */
"Device power is off" = "Alimentação de dispositivo desativada";

/* errno error 83 */
"Device error" = "Erro de dispositivo";

/* errno error 84 */
"Value too large to be stored in data type" = "Valor muito grande para ser armazenado no tipo de dados";

/* errno error 85 */
"Bad executable (or shared library)" = "Executável inválido (ou biblioteca compartilhada)";

/* errno error 86 */
"Bad CPU type in executable" = "Tipo de CPU inválido em executável";

/* errno error 87 */
"Shared library version mismatch" = "A versão de biblioteca compartilhada não coincide";

/* errno error 88 */
"Malformed Mach-o file" = "Arquivo Mach-o Mal-formado";

/* errno error 89 */
"Operation canceled" = "Operação cancelada";

/* errno error 90 */
"Identifier removed" = "Identificador removido";

/* errno error 91 */
"No message of desired type" = "Nenhuma mensagem do tipo desejado";

/* errno error 92 */
"Illegal byte sequence" = "Seqüência de byte ilegal";

/* errno error 93 */
"Attribute not found" = "Atributo não encontrado";

/* errno error 94 */
"Bad message" = "Mensagem inválida";

/* errno error 95 */
"EMULTIHOP (Reserved)" = "EMULTIHOP (Reservado)";

/* errno error 96 */
"No message available on STREAM" = "Nenhuma mensagem disponível no FLUXO";

/* errno error 97 */
"ENOLINK (Reserved)" = "ENOLINK (Reservado)";

/* errno error 98 */
"No STREAM resources" = "Nenhum recurso de FLUXO";

/* errno error 99 */
"Not a STREAM" = "Não é um FLUXO";

/* errno error 100 */
"Protocol error" = "Erro de protocolo";

/* errno error 101 */
"STREAM ioctl timeout" = "Tempo esgotado de controle de entrada/saída de FLUXO";

/* errno error 102 */
"Operation not supported on socket" = "Operação incompatível com soquete";

/* errno error 103 */
"Policy not found" = "Política não encontrada";
